app/controllers/school_classes_controller.rb

  def create

    ###Bug fix for test
    if params.has_key?(:school_classes)
      @school_class = SchoolClass.find_or_create_by(school_classes_params(:title,
                                                                          :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-04-28 01:05:59.433668"], ["updated_at", "2019-04-28 01:05:59.433668"]]
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."title" = ? AND "school_classes"."room_number" = ? LIMIT ?  [["title", "Computer Science"], ["room_number", 5], ["LIMIT", 1]]