app/controllers/students_controller.rb

  def create
    @student = Student.find_or_create_by(student_params(:first_name,
                                                        :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-29 21:27:20.203639"], ["updated_at", "2019-04-29 21:27:20.203639"]]
SELECT  "students".* FROM "students" WHERE "students"."first_name" = ? AND "students"."last_name" = ? LIMIT ?  [["first_name", "Bill"], ["last_name", "Smith"], ["LIMIT", 1]]

  def update
    @student = Student.update(student_params(:first_name,
                                                        :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-29 21:33:46.241700"], ["id", 1]]